stm32-hotspot/STM32WBA-BLE-USBx-Class-Audio/Projects/STM32WBA65I-DK1/Applications/USBX/Ux_Device_Audio_2.0_Standalone/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32wbaxx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define VCP_TX_Pin GPIO_PIN_12
#define VCP_TX_GPIO_Port GPIOB
#define VCP_TXA8_Pin GPIO_PIN_8
#define VCP_TXA8_GPIO_Port GPIOA
#define SCK_A_Pin GPIO_PIN_7
#define SCK_A_GPIO_Port GPIOA
#define USER_Buttons_Pin GPIO_PIN_3
#define USER_Buttons_GPIO_Port GPIOA
#define SPI3_MISO_Pin GPIO_PIN_1
#define SPI3_MISO_GPIO_Port GPIOA
#define SPI3_SCK_Pin GPIO_PIN_0
#define SPI3_SCK_GPIO_Port GPIOA
#define LD5_Pin GPIO_PIN_9
#define LD5_GPIO_Port GPIOD
#define LD8_Pin GPIO_PIN_8
#define LD8_GPIO_Port GPIOD
#define USB_HS_N_Pin GPIO_PIN_7
#define USB_HS_N_GPIO_Port GPIOD
#define USB_HS_P_Pin GPIO_PIN_6
#define USB_HS_P_GPIO_Port GPIOD
#define SD_A_Pin GPIO_PIN_5
#define SD_A_GPIO_Port GPIOD
#define SPI3_MOSI_Pin GPIO_PIN_8
#define SPI3_MOSI_GPIO_Port GPIOB
#define OSC32_OUT_Pin GPIO_PIN_15
#define OSC32_OUT_GPIO_Port GPIOC
#define OSC32_IN_Pin GPIO_PIN_14
#define OSC32_IN_GPIO_Port GPIOC
#define RST_DISP_Pin GPIO_PIN_3
#define RST_DISP_GPIO_Port GPIOE
#define MCLK_A_Pin GPIO_PIN_2
#define MCLK_A_GPIO_Port GPIOE
#define CS_DISP_Pin GPIO_PIN_1
#define CS_DISP_GPIO_Port GPIOE
#define D_C_DISP_Pin GPIO_PIN_0
#define D_C_DISP_GPIO_Port GPIOE
#define SWO_Pin GPIO_PIN_3
#define SWO_GPIO_Port GPIOB
#define JTDI_Pin GPIO_PIN_15
#define JTDI_GPIO_Port GPIOA
#define SWCLK_Pin GPIO_PIN_14
#define SWCLK_GPIO_Port GPIOA
#define SWDIO_Pin GPIO_PIN_13
#define SWDIO_GPIO_Port GPIOA
#define I2C1_SCL_Pin GPIO_PIN_2
#define I2C1_SCL_GPIO_Port GPIOB
#define I2C1_SDA_Pin GPIO_PIN_1
#define I2C1_SDA_GPIO_Port GPIOB
#define SD_B_Pin GPIO_PIN_5
#define SD_B_GPIO_Port GPIOC
#define FS_A_Pin GPIO_PIN_4
#define FS_A_GPIO_Port GPIOC

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
